Tekla.Structures.ModelInternal.Operation.DotSharingWriteOutModeEnum
Write out mode.

Tekla.Structures.ModelInternal.Operation.DotSharingWriteOutModeEnum.FIRST_FULL
First packet, always full.

Tekla.Structures.ModelInternal.Operation.DotSharingWriteOutModeEnum.FULL
Full packet (not first).

Tekla.Structures.ModelInternal.Operation.DotSharingWriteOutModeEnum.INCREMENTAL
Incremental packet.